[
  {
    "buttonText": "What are Managed Contests?",
    "infoText": [
      "The \"Managed\" option is a fully managed service by Squadhelp Branding experts. It includes a formal brief preparation by Squadhelp team and management of your contest. Managed Contests are a great fit for companies that are looking for an \"Agency\" like experience and they do not want to manage the contest directly.",
      "Our branding team has directly managed hundreds of branding projects and has learned several best practices that lead to successful project outcomes. Our team will apply all best practices towards the management of your branding project.",
      "Learn more about our"
    ],
    "linkText": {
      "path": "https://www.squadhelp.com/managed-contests",
      "name": "Managed Contest Service"
    }
  },
  {
    "buttonText": "What`s a typical timeline for a Managed Contest?",
    "infoText": "The overall process takes 12-13 days.",
    "listText": [
      "The Managed projects start with a project kick-off call with your Branding Consultant. You can schedule this call online immediately after making your payment.",
      "After your kick-off call, the Branding consultant will write your project brief and send for your approval within 1 business day.",
      "Upon your approval, the contest will go live. The branding consultant will help manage your project throughout the brainstorming phase (typically 5 days).",
      "Upon the completion of brainstorming phase, the branding consultant will work with you to test the top 6 names from your Shortlist (3-5 Days). In addition, the branding consultant will coordinate the detailed Trademark screening (1-3 days)"
    ]
  },
  {
    "buttonText": "How much do Managed Contests cost?",
    "infoText": "We offer two levels of Managed Contests. Standard ($999) and Enterprise ($1999). The Enterprise managed contest includes:",
    "listText": [
      "(1) a $500 award amount (instead of $300), which willattract our top Creatives and provide more options to choose from;",
      "(2) we will ensure a senior member of our branding team is assigned to your project and the branding team will invest about 3X more time in the day-to-day management of your project;",
      "(3) you will receive more high-end trademark report and 5X more responses for your audience test.",
      "Here is a link to our ",
      "with a detailed comparison of the two packages."
    ],
    "linkText": {
      "path": "https://www.squadhelp.com/pricing.php?bundle-id=4",
      "name": "Pricing Page"
    }
  },
  {
    "buttonText": "Where are the Branding Consultants located?",
    "infoText": "All our branding consultants are based in in our Headquarters (Hoffman Estates, IL). Our branding consultants have many years of experience in managing hundreds of branding projects for companies ranging from early stage startups to Fortune 500 corporations."
  }
]
